Repository: meas-ravy/JobFinder-Mobile
Catalog: lib/l10n/app_*.arb
Languages: km, lo

source: Login
km: ចូលគណនី
lo: ເຂົ້າສູ່ລະບົບ

# welcomeBack
source: Welcome back to the app
km: សូមស្វាគមន៍មកកាន់កម្មវិធីវិញ
lo: ຍິນດີຕ້ອນຮັບກັບຄືນສູ່ແອັບ

source: Enter phone number
km: បញ្ចូលលេខទូរស័ព្ទ
lo: ປ້ອນເບີໂທລະສັບ

# chooseLanguage
source: Choose the language
km: ជ្រើសរើសភាសា
lo: ເລືອກພາສາ

# selectLanguageSubtitle
source: Select your preferred language below. This helps us serve you better.
km: សូមជ្រើសរើសភាសាដែលអ្នកពេញចិត្តខាងក្រោម។ វាជួយឱ្យយើងបម្រើអ្នកបានកាន់តែប្រសើរ។
lo: ເລືອກພາສາທີ່ທ່ານຕ້ອງການຂ້າງລຸ່ມນີ້. ນີ້ຊ່ວຍໃຫ້ພວກເຮົາບໍລິການທ່ານໄດ້ດີຂຶ້ນ.

source: Suggestion
km: ការណែនាំ
lo: ຄຳແນະນຳ

# allLanguagesLabel
source: All Languages
km: ភាសាទាំងអស់
lo: ທຸກພາສາ

source: Search
km: ស្វែងរក
lo: ຄົ້ນຫາ

source: Cambodia
km: កម្ពុជា
lo: ກຳປູເຈຍ

source: English(US)
km: អង់គ្លេស(អាមេរិក)
lo: ພາສາອັງກິດ(US)

source: Japan
km: ជប៉ុន
lo: ຍີ່ປຸ່ນ

source: China
km: ចិន
lo: ຈີນ

source: Malaysia
km: ម៉ាឡេស៊ី
lo: ມາເລເຊຍ

source: Laos
km: ឡាវ
lo: ລາວ

source: Korean
km: កូរ៉េ
lo: ເກົາຫຼີ

source: Language
km: ភាសា
lo: ພາສາ

# profileTitle
source: Profile
km: ព័ត៌មានផ្ទាល់ខ្លួន
lo: ຂໍ້ມູນສ່ວນຕົວ

# profileCompletedTitle
source: Profile Completed!
km: បំពេញព័ត៌មានបានរួចរាល់!
lo: ຂໍ້ມູນສ່ວນຕົວສຳເລັດແລ້ວ!

# profileCompletedSubtitle
source: A complete profile increases the chances of a recruiter being more interested in recruiting you
km: ការបំពេញព័ត៌មានបានគ្រប់គ្រាន់ បង្កើនឱកាសឱ្យអ្នកជ្រើសរើសបុគ្គលិកចាប់អារម្មណ៍កាន់តែខ្លាំងក្នុងការជ្រើសរើសអ្នក
lo: ຂໍ້ມູນສ່ວນຕົວທີ່ສົມບູນຈະຊ່ວຍເພີ່ມໂອກາດໃຫ້ຜູ້ຮັບສະໝັກສົນໃຈທ່ານຫຼາຍຂຶ້ນ

source: My Resume
km: ប្រវត្តិរូបសង្ខេបរបស់ខ្ញុំ
lo: ຊີວະປະຫວັດຂອງຂ້ອຍ

source: Switch to Recruiter
km: ប្តូរទៅជាអ្នកជ្រើសរើសបុគ្គលិក
lo: ປ່ຽນເປັນຜູ້ຮັບສະໝັກ

# switchRoleTitle
source: Switch Role
km: ប្តូរតួនាទី
lo: ປ່ຽນບົດບາດ

# switchRoleContent
source: Switch to Recruiter mode? You can switch back anytime.
km: ប្តូរទៅជារបៀបអ្នកជ្រើសរើសបុគ្គលិក? អ្នកអាចប្តូរមកវិញបានគ្រប់ពេល។
lo: ປ່ຽນເປັນໂໝດຜູ້ຮັບສະໝັກ? ທ່ານສາມາດປ່ຽນກັບຄືນໄດ້ທຸກເວລາ.

source: Cancel
km: បោះបង់
lo: ຍົກເລີກ

# switchLabel
source: Switch
km: ប្តូរ
lo: ປ່ຽນ

source: Switching to Recruiter...
km: កំពុងប្តូរទៅជាអ្នកជ្រើសរើសបុគ្គលិក...
lo: ກຳລັງປ່ຽນເປັນຜູ້ຮັບສະໝັກ...

source: Failed to switch role
km: ការប្តូរតួនាទីមិនបានសម្រេច
lo: ປ່ຽນບົດບາດບໍ່ສຳເລັດ

# generalSection
source: General
km: ទូទៅ
lo: ທົ່ວໄປ

source: Notification
km: ការជូនដំណឹង
lo: ການແຈ້ງເຕືອນ

source: Security
km: សុវត្ថិភាព
lo: ຄວາມປອດໄພ

# aboutSection
source: About
km: អំពី
lo: ກ່ຽວກັບ

source: Privacy & Policy
km: គោលការណ៍ឯកជនភាព
lo: ນະໂຍບາຍຄວາມເປັນສ່ວນຕົວ

source: Terms of Services
km: លក្ខខណ្ឌប្រើប្រាស់
lo: ເງື່ອນໄຂການບໍລິການ

source: About us
km: អំពីយើង
lo: ກ່ຽວກັບພວກເຮົາ

source: Logout
km: ចាកចេញ
lo: ອອກຈາກລະບົບ

# logoutConfirmTitle
source: Logout
km: ចាកចេញ
lo: ອອກຈາກລະບົບ

# logoutConfirmContent
source: Are you sure you want to logout?
km: តើអ្នកប្រាកដជាចង់ចាកចេញមែនទេ?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການອອກຈາກລະບົບ?

source: My Documents
km: ឯកសាររបស់ខ្ញុំ
lo: ເອກະສານຂອງຂ້ອຍ

source: New resume
km: បង្កើតប្រវត្តិរូបថ្មី
lo: ສ້າງຊີວະປະຫວັດໃໝ່

source: Cover letter
km: លិខិតអម
lo: ຈົດໝາຍແນະນຳຕົວ

# featureSoonMessage
source: We will add this feature soon, stay tuned!
km: យើងនឹងបន្ថែមមុខងារនេះក្នុងពេលឆាប់ៗនេះ សូមរង់ចាំ!
lo: ພວກເຮົາຈະເພີ່ມຄຸນສົມບັດນີ້ໃນໄວໆນີ້, ກະລຸນາລໍຖ້າ!

source: My Resumes
km: ប្រវត្តិរូបរបស់ខ្ញុំ
lo: ຊີວະປະຫວັດຂອງຂ້ອຍ

source: No resumes yet
km: មិនទាន់មានប្រវត្តិរូបនៅឡើយទេ
lo: ຍັງບໍ່ມີຊີວະປະຫວັດເທື່ອ

# createFirstResume
source: Create your first resume to get started
km: បង្កើតប្រវត្តិរូបដំបូងរបស់អ្នកដើម្បីចាប់ផ្តើម
lo: ສ້າງຊີວະປະຫວັດທຳອິດຂອງທ່ານເພື່ອເລີ່ມຕົ້ນ

# deleteCvTitle
source: Delete CV
km: លុបប្រវត្តិរូប
lo: ລຶບຊີວະປະຫວັດ

# deleteCvConfirm
source: Are you sure you want to delete this CV?
km: តើអ្នកប្រាកដជាចង់លុបប្រវត្តិរូបនេះមែនទេ?
lo: ທ່ານແນ່ໃຈບໍ່ວ່າຕ້ອງການລຶບຊີວະປະຫວັດນີ້?

# deleteLabel
source: Delete
km: លុប
lo: ລຶບ

# errorLabel
source: Error: {error}
km: កំហុស៖ {error}
lo: ຂໍ້ຜິດພາດ: {error}

source: Choose Template
km: ជ្រើសរើសគំរូ
lo: ເລືອກແມ່ແບບ

# searchTemplateHint
source: Search your template
km: ស្វែងរកគំរូរបស់អ្នក
lo: ຄົ້ນຫາແມ່ແບບ

# allTab
source: All
km: ទាំងអស់
lo: ທັງໝົດ

# simpleTab
source: Simple
km: ធម្មតា
lo: ທຳມະດາ

# professionalTab
source: Professional
km: អាជីព
lo: ມືອາຊີບ

# minimalistTab
source: Minimalist
km: សាមញ្ញបំផុត
lo: ລຽບງ່າຍ

# modernTab
source: Modern
km: ទំនើប
lo: ທັນສະໄໝ

source: No templates found
km: រកមិនឃើញគំរូទេ
lo: ບໍ່ພົບແມ່ແບບ

# pdfLanguageWarning
source: Note: PDF templates currently only support English characters. Other languages (like Khmer) may not display correctly.
km: ចំណាំ៖ គំរូ PDF បច្ចុប្បន្នគាំទ្រតែអក្សរអង់គ្លេសប៉ុណ្ណោះ។ ភាសាផ្សេងទៀត (ដូចជាខ្មែរ) អាចនឹងមិនបង្ហាញត្រឹមត្រូវទេ។
lo: ໝາຍເຫດ: ແມ່ແບບ PDF ປະຈຸບັນຮອງຮັບພຽງແຕ່ຕົວອັກສອນພາສາອັງກິດເທົ່ານັ້ນ. ພາສາອື່ນໆ (ເຊັ່ນ: ພາສາລາວ ຫຼື ພາສາຂະແມ) ອາດຈະບໍ່ສະແດງຜົນຢ່າງຖືກຕ້ອງ.

# createCvTitle
source: Create CV
km: បង្កើតប្រវត្តិរូប
lo: ສ້າງຊີວະປະຫວັດ

# personalInfo
source: Personal Information
km: ព័ត៌មានផ្ទាល់ខ្លួន
lo: ຂໍ້ມູນສ່ວນຕົວ

# reachRecruiters
source: Let recruiters know how to reach you
km: អនុញ្ញាតឱ្យអ្នកជ្រើសរើសបុគ្គលិកដឹងពីរបៀបទាក់ទងអ្នក
lo: ໃຫ້ຜູ້ຮັບສະໝັກຮູ້ວິທີຕິດຕໍ່ຫາທ່ານ

# fullNameLabel
source: Full Name
km: ឈ្មោះពេញ
lo: ຊື່ເຕັມ

# emailLabel
source: Email
km: អ៊ីមែល
lo: ອີເມວ

# locationLabel
source: Location
km: ទីតាំង
lo: ທີ່ຢູ່

# locationHint
source: Phnom Penh, Cambodia
km: ភ្នំពេញ, កម្ពុជា
lo: ພະນົມເປັນ, ກຳປູເຈຍ

# phoneLabel
source: Phone
km: លេខទូរស័ព្ទ
lo: ເບີໂທລະສັບ

# personalSummaryLabel
source: Personal Summary
km: សេចក្តីសង្ខេបផ្ទាល់ខ្លួន
lo: ບົດສະຫຼຸບສ່ວນຕົວ

# personalSummaryHint
source: Write a brief summary about yourself...
km: សរសេរសេចក្តីសង្ខេបខ្លីៗអំពីខ្លួនអ្នក...
lo: ຂຽນບົດສະຫຼຸບສັ້ນໆກ່ຽວກັບຕົວທ່ານເອງ...

source: Work Experience
km: បទពិសោធន៍ការងារ
lo: ປະສົບການເຮັດວຽກ

# workExperienceSubtitle
source: Enter details about your previous jobs
km: បញ្ចូលព័ត៌មានលម្អិតអំពីការងារពីមុនរបស់អ្នក
lo: ປ້ອນລາຍລະອຽດກ່ຽວກັບວຽກທີ່ຜ່ານມາຂອງທ່ານ

source: Add Experience
km: បន្ថែមបទពិសោធន៍
lo: ເພີ່ມປະສົບການ

# educationTitle
source: Education
km: ការអប់រំ
lo: ການສຶກສາ

# educationSubtitle
source: List your educational background
km: រាយបញ្ជីប្រវត្តិការសិក្សារបស់អ្នក
lo: ລາຍຊື່ປະຫວັດການສຶກສາຂອງທ່ານ

source: Add Education
km: បន្ថែមការសិក្សា
lo: ເພີ່ມການສຶກສາ

source: Skills & Languages
km: ជំនាញ និងភាសា
lo: ທັກສະ ແລະ ພາສາ

# skillsLanguagesSubtitle
source: Highlight your key competencies
km: រំលេចសមត្ថភាពសំខាន់ៗរបស់អ្នក
lo: ເນັ້ນຄວາມສາມາດຫຼັກຂອງທ່ານ

# skillsLabel
source: Skills
km: ជំនាញ
lo: ທັກສະ

# skillsHint
source: e.g., Flutter, Dart, UI/UX (comma separated)
km: ឧទាហរណ៍៖ Flutter, Dart, UI/UX (ញែកដោយសញ្ញាក្បៀស)
lo: ເຊັ່ນ: Flutter, Dart, UI/UX (ແຍກດ້ວຍຈຸດ)

# languagesLabel
source: Languages
km: ភាសា
lo: ພາສາ

# languagesHint
source: e.g., Khmer, English (comma separated)
km: ឧទាហរណ៍៖ ខ្មែរ, អង់គ្លេស (ញែកដោយសញ្ញាក្បៀស)
lo: ເຊັ່ນ: ພາສາລາວ, ພາສາອັງກິດ (ແຍກດ້ວຍຈຸດ)

# referencesTitle
source: References
km: ឯកសារយោង
lo: ເອກະສານອ້າງອີງ

# referencesSubtitle
source: Add people who can vouch for you
km: បន្ថែមមនុស្សដែលអាចធានាឱ្យអ្នក
lo: ເພີ່ມຄົນທີ່ສາມາດຮັບຮອງທ່ານໄດ້

source: Add Reference
km: បន្ថែមឯកសារយោង
lo: ເພີ່ມເອກະສານອ້າງອີງ

# backButton
source: Back
km: ត្រឡប់ក្រោយ
lo: ກັບຄືນ

source: Preview & Export
km: មើលជាមុន និងនាំចេញ
lo: ເບິ່ງຕົວຢ່າງ ແລະ ສົ່ງອອກ

source: Next Step
km: ជំហានបន្ទាប់
lo: ຂັ້ນຕອນຕໍ່ໄປ

# fixPersonalInfoError
source: Please fix errors in Personal Info
km: សូមកែតម្រូវកំហុសក្នុងព័ត៌មានផ្ទាល់ខ្លួន
lo: ກະລຸນາແກ້ໄຂຂໍ້ຜິດພາດໃນຂໍ້ມູນສ່ວນຕົວ

source: Edit Education
km: កែសម្រួលការសិក្សា

# degreeLabel
source: Degree
km: សញ្ញាបត្រ

# degreeHint
source: Bachelor of Computer Science
km: បរិញ្ញាបត្រវិទ្យាសាស្ត្រកុំព្យូទ័រ

# institutionLabel
source: Institution
km: គ្រឹះស្ថានសិក្សា

# institutionHint
source: Royal University of Phnom Penh
km: សាកលវិទ្យាល័យភូមិន្ទភ្នំពេញ

# startDateLabel
source: Start Date
km: ថ្ងៃចាប់ផ្តើម

# endDateLabel
source: End Date
km: ថ្ងៃបញ្ចប់

# cancelButton
source: Cancel
km: បោះបង់

# updateButton
source: Update
km: ធ្វើបច្ចុប្បន្នភាព

# addButton
source: Add
km: បន្ថែម

source: Edit Experience
km: កែសម្រួលបទពិសោធន៍

# jobTitleLabel
source: Job Title
km: តួនាទី

# jobTitleHint
source: Software Engineer
km: វិស្វករកម្មវិធី

# companyNameLabel
source: Company Name
km: ឈ្មោះក្រុមហ៊ុន

# jobDescriptionLabel
source: Job Description
km: ការពិពណ៌នាការងារ

# jobDescriptionHint
source: Type each point on a new line. e.g. Developed mobile apps Fixed critical bugs
km: វាយបញ្ចូលចំណុចនីមួយៗនៅលើបន្ទាត់ថ្មី។ ឧទាហរណ៍៖ បង្កើតកម្មវិធីទូរស័ព្ទ ជួសជុលកំហុសកម្មវិធី

source: Edit Reference
km: កែសម្រួលឯកសារយោង

# positionLabel
source: Position
km: តំណែង

# positionHint
source: Senior Manager
km: អ្នកគ្រប់គ្រងជាន់ខ្ពស់

# companyOptionalLabel
source: Company (Optional)
km: ក្រុមហ៊ុន (ស្រេចចិត្ត)

# homeLabel
source: Home
km: ទំព័រដើម
lo: ໜ້າຫຼັກ

# saveJobLabel
source: Save Job
km: រក្សាទុក
lo: ບັນທຶກໄວ້

# applicationLabel
source: Application
km: កម្មវិធី
lo: ຄຳຮ້ອງ

# messageLabel
source: Message
km: សារ
lo: ຂໍ້ຄວາມ

# profileLabel
source: Profile
km: គណនី
lo: ໂປຣໄຟລ໌

# appliedLabel
source: Applied
km: បានដាក់ពាក្យ
lo: ສະໝັກແລ້ວ

# statsLabel
source: Stats
km: ស្ថិតិ
lo: ສະຖິຕິ

# fullNameHint
source: Jake sonner
lo: ເຈັກ ຊອນເນີ
